http://www.datasciencemadesimple.com/join-merge-data-frames-pandas-python/

In [53]:
import pandas as pd
import numpy as np
 
# data frame 1
d1 = {
    'Customer_id':pd.Series([1,2,3,4,5,6]),
    'Product':pd.Series(['Oven','Oven','Oven','Television','Television','Television']),
    'Price':pd.Series([87.5,66.8,44,32,88,25])
                        }
df1 = pd.DataFrame(d1)
print(df1)
print()

# data frame 2
d2 ={
    'Customer_id':pd.Series([5,6,7,8,9]),
    'State':pd.Series(['California','California','Texas', 'Gujarat', 'Delhi']),
    'Price':pd.Series([66.8,32,25,88,39])
}
df2 = pd.DataFrame(d2)
print(df2)

   Customer_id     Product  Price
0            1        Oven   87.5
1            2        Oven   66.8
2            3        Oven   44.0
3            4  Television   32.0
4            5  Television   88.0
5            6  Television   25.0

   Customer_id       State  Price
0            5  California   66.8
1            6  California   32.0
2            7       Texas   25.0
3            8     Gujarat   88.0
4            9       Delhi   39.0

In [54]:
#inner join in python pandas
print (pd.merge(df1, df2, on='Customer_id', how='inner'))
# Common columns are suffixed with _x and _y by default

   Customer_id     Product  Price_x       State  Price_y
0            5  Television     88.0  California     66.8
1            6  Television     25.0  California     32.0

In [55]:
# outer join in python pandas
print (pd.merge(df1, df2, on='Customer_id', how='outer',suffixes=('Left_waala','Right_waala')))

   Customer_id     Product  PriceLeft_waala       State  PriceRight_waala
0            1        Oven             87.5         NaN               NaN
1            2        Oven             66.8         NaN               NaN
2            3        Oven             44.0         NaN               NaN
3            4  Television             32.0         NaN               NaN
4            5  Television             88.0  California              66.8
5            6  Television             25.0  California              32.0
6            7         NaN              NaN       Texas              25.0
7            8         NaN              NaN     Gujarat              88.0
8            9         NaN              NaN       Delhi              39.0

In [56]:
# left join in python
print (pd.merge(df1, df2, on='Customer_id', how='left'))

   Customer_id     Product  Price_x       State  Price_y
0            1        Oven     87.5         NaN      NaN
1            2        Oven     66.8         NaN      NaN
2            3        Oven     44.0         NaN      NaN
3            4  Television     32.0         NaN      NaN
4            5  Television     88.0  California     66.8
5            6  Television     25.0  California     32.0

In [57]:
# right join in python pandas
 
print (pd.merge(df1, df2, on='Customer_id', how='right'))

   Customer_id     Product  Price_x       State  Price_y
0            5  Television     88.0  California     66.8
1            6  Television     25.0  California     32.0
2            7         NaN      NaN       Texas     25.0
3            8         NaN      NaN     Gujarat     88.0
4            9         NaN      NaN       Delhi     39.0

In [58]:
display(df1,df2) # another way to display data-frames

   Customer_id     Product  Price
0            1        Oven   87.5
1            2        Oven   66.8
2            3        Oven   44.0
3            4  Television   32.0
4            5  Television   88.0
5            6  Television   25.0

   Customer_id       State  Price
0            5  California   66.8
1            6  California   32.0
2            7       Texas   25.0
3            8     Gujarat   88.0
4            9       Delhi   39.0

In [59]:
print(pd.merge(left=df1,right=df2, left_on='Customer_id', right_on='Customer_id', how='inner'))

# left_on, right_on used when the column to be joined has different names in different dataframes

   Customer_id     Product  Price_x       State  Price_y
0            5  Television     88.0  California     66.8
1            6  Television     25.0  California     32.0

In [62]:
display(df1) # here index is default 0,1,2....
print(df1.set_index('Product',inplace=False)) # changes index

   Customer_id     Product  Price
0            1        Oven   87.5
1            2        Oven   66.8
2            3        Oven   44.0
3            4  Television   32.0
4            5  Television   88.0
5            6  Television   25.0

            Customer_id  Price
Product
Oven                  1   87.5
Oven                  2   66.8
Oven                  3   44.0
Television            4   32.0
Television            5   88.0
Television            6   25.0

In [69]:
# Left-excluding merge. Keeps Left excludes common ones

(pd.merge(df1, df2, on='Customer_id', how='left', indicator=True)
     .query('_merge == "left_only"')
     .drop('_merge', 1))

   Customer_id     Product  Price_x State  Price_y
0            1        Oven     87.5   NaN      NaN
1            2        Oven     66.8   NaN      NaN
2            3        Oven     44.0   NaN      NaN
3            4  Television     32.0   NaN      NaN

In [70]:
# Right-excluding merge. Keeps Right excludes common ones

(pd.merge(df1, df2, on='Customer_id', how='right', indicator=True)
     .query('_merge == "right_only"')
     .drop('_merge', 1))

   Customer_id Product  Price_x    State  Price_y
2            7     NaN      NaN    Texas     25.0
3            8     NaN      NaN  Gujarat     88.0
4            9     NaN      NaN    Delhi     39.0

In [75]:
# Anti-join. Excludes the common (inner) ones

(pd.merge(df1, df2, on='Customer_id', how='outer', indicator=True)
     .query('_merge != "both"')
     .drop('_merge', 1))

   Customer_id     Product  Price_x    State  Price_y
0            1        Oven     87.5      NaN      NaN
1            2        Oven     66.8      NaN      NaN
2            3        Oven     44.0      NaN      NaN
3            4  Television     32.0      NaN      NaN
6            7         NaN      NaN    Texas     25.0
7            8         NaN      NaN  Gujarat     88.0
8            9         NaN      NaN    Delhi     39.0

In [82]:
# Count the number of occurences
print(df1['Product'].value_counts())
print()
print(df1.groupby('Product').count())
print()
print(df1.groupby('Product')['Product'].transform('count'))

Oven          3
Television    3
Name: Product, dtype: int64

            Customer_id  Price
Product
Oven                  3      3
Television            3      3

0    3
1    3
2    3
3    3
4    3
5    3
Name: Product, dtype: int64